SRC/Config/DataProcessors/с_ИнициализацияЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>с_ИнициализацияЗначений</Name>
			<Comment>v1.0</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

SRC/Config/InformationRegisters/с_ВерсииВыполненнойИнициализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>с_ВерсииВыполненнойИнициализации</Name>
			<Comment>//Ситис:p.virich</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

SRC/Config/DataProcessors/с_ИнициализацияЗначений/Ext/ManagerModule.bsl
// ++ Ситис: p.virich 0  2018-07-08
Функция ВыполнениеИнициализации()  Экспорт 
	
	Для Ном=1 По 100 Цикл
		
		СтрокаКоманды = "Действие"+Ном+"(Ложь, Версия);";
		Попытка  			 
			Версия = 0;
			Выполнить(СтрокаКоманды);
			//
			МенеджерЗаписи = РегистрыСведений.с_ВерсииВыполненнойИнициализации.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.НомерДействия = Ном;
			МенеджерЗаписи.Версия = Версия;
			МенеджерЗаписи.Записать();
			
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецФункции // -- Ситис: p.virich 0  2018-07-08 

// ++ Ситис: p.virich 0  2018-07-08
Процедура Действие1(ТолькоПроверка, ВозвращаемаяВерсия)
	
	ВозвращаемаяВерсия = 1;
	
	Если ТолькоПроверка Тогда
		Возврат
	КонецЕсли;
	
	//Выполнение действий
	
КонецПроцедуры   // -- Ситис: p.virich 0  2018-07-08

// ++ Ситис: p.virich 0  2018-07-08
Процедура Действие2(ТолькоПроверка, ВозвращаемаяВерсия)

	 ВозвращаемаяВерсия = 1;

	 Если ТолькоПроверка Тогда
	 		Возврат
		КонецЕсли;
		
		//Выполнение действий


 КонецПроцедуры   // -- Ситис: p.virich 0  2018-07-08
